[
  {
    "id": "1",
    "title": "SyncSpace",
    "description": "SyncSpace is a project management solution focused on simplifying the complex process of initiating and overseeing projects. It operates as a centralized platform, providing tools and functionalities that facilitate the organization, tracking, collaboration, and data restrictions required for project execution. Employing AI integrations, SyncSpace streamlines the creation of project kanban boards and cards, allowing for intuitive project setup and management. SyncSpace aims to alleviate the challenges typically encountered in project launches, especially for newcomers and those exploring app development. By automating board and card creation based on user-provided descriptions or templates, SyncSpace reduces the time and effort required for project setup. This efficiency in project initialization empowers users to reduce time spent conceptualizing ideas and spend more time executing actionable tasks, enhancing productivity and project success rates. When running the deployment link, either launch on your phone or use your browsers emulator to get correct sizing of elements.",
    "tags": [],
    "sortOrder": 10,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/SyncSpace.png",
    "sourceUrl": "https://github.com/Sync-Space-49"
  },
  {
    "id": "2",
    "title": "Class Connect",
    "description": "Class Connect is designed to facilitate efficient scheduling of office hours for students with their Teaching Assistants or Professors. It provides a user-friendly interface for students to book appointments based on the availability of their instructional teams. It includes a reputation-based restriction system for students who repeatedly show misconduct (e.g., \"no call, no show\" instances) may face restrictions on their booking privileges. Key features include Server Side Rendering, SSO with Google, and integration with the Zoom API for automatic meeting and calendar invites.",
    "tags": [],
    "sortOrder": 20,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/Class_Connect.png",
    "sourceUrl": "https://github.com/DylanHalstead/ClassConnect"
  },
  {
    "id": "3",
    "title": "CS Materials",
    "description": "An research project conducted at the University of North Carolina at Charlotte, CS Materials aims to revolutionize the way computer science materials are created, analyzed, and searched for by visualizing complex course data through D3 and by utilizing established guidelines from the Association for Computing Machinery (ACM) and Program Design and Complexity (PDC). By leveraging these guidelines, CS Materials seeks to enhance the efficiency and effectiveness of CS education. Some tools in the project include a radial tree view of abstract to specific topics, a similarity graph showing the similarities in course collections, a comparison view to see what topics certain classes align and diverge from, and a NMF matrix that helps depict \"types\" or \"genres\" of specific CS courses (e.g. different flavors of Data Structures courses).",
    "tags": [],
    "sortOrder": 30,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/CS_Materials.png",
    "deploymentUrl": "https://cs-materials.herokuapp.com",
    "sourceUrl": "https://github.com/BridgesUNCC/cs-materials-react-webclient"
  },
  {
    "id": "4",
    "title": "Old Personal Portfolio",
    "description": "My Original Personal Portfolio. A simple SPA where I can show users what cool projects I've worked on. Learned a lot about cloud providers (specifically GCP) and their services getting this running. Learned things like DNS mapping between GCP and Cloudflare, setting up buckets to host images, and CI/CD for docker/container automatic deployment.",
    "tags": [],
    "sortOrder": 40,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/Personal_Portfolio.png",
    "sourceUrl": "https://github.com/DylanHalstead/personal-portfolio"
  },
  {
    "id": "5",
    "title": "Coding Corner",
    "description": "Originally a discord server for UNC Charlotte Computer Science students, Coding Corner is the place for CS students to plan meetups, find and attend get-togethers, and make new friends! An event CRUD resource built for Network-Based Application Development, Coding Corning was my final project for ITCS 4166 at UNCC with additional features added by myself.",
    "tags": [],
    "sortOrder": 50,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/Coding_Corner.png",
    "deploymentUrl": "https://coding-corner.onrender.com/",
    "sourceUrl": "https://github.com/DylanHalstead/Coding_Corner"
  },
  {
    "id": "6",
    "title": "AutoBlackjack",
    "description": "AutoBlackjack is a computer vision application designed to assist users in making informed decisions in the game of Blackjack. Using machine learning techniques and computer vision, AutoBlackjack helps identify the best possible move to make with any hand of Blackjack. This project was built for Marco Scipioni's Computer Vision with Python (DTSC 3000) course at UNC Charlotte.",
    "tags": [],
    "sortOrder": 60,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/AutoBlackjack.png",
    "sourceUrl": "https://github.com/DylanHalstead/AutoBlackjack"
  },
  {
    "id": "7",
    "title": "Sleep Logger",
    "description": "This is my first more robust android/mobile application. SleepLogger is a simple Android application designed to help users track and analyze their sleep patterns. With SleepLogger, users can log their sleep duration, sleep quality, and exercise time. Sleep Logger makes it easy to analyze by including visualizations of the user's sleeping patterns.",
    "tags": [],
    "sortOrder": 70,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/SleepLogger.png",
    "sourceUrl": "https://github.com/DylanHalstead/SleepLogger"
  },
  {
    "id": "8",
    "title": "Charlotte Cinemaholics",
    "description": "Developed with peers, Austin Hadinger and Alex Stahlman for the final of ITSC 3155 (1st place!), Charlotte Cinemaholics is a CRUD application that serves as a platform for a club at UNCC to talk about films. Leveraging cloud hosting originally via Heroku and embracing DevOps through GitHub Actions, users could create accounts, post, comment, and review movies.",
    "tags": [],
    "sortOrder": 80,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/Charlotte_Cinemaholics.png",
    "deploymentUrl": "",
    "sourceUrl": "https://github.com/DylanHalstead/Charlotte-Cinemaholics"
  },
  {
    "id": "9",
    "title": "2D Ray Casting Demo",
    "description": "I needed to make some code to create 2D light simulation(s) with accurate calculations. Utilizes the p5.js library and handles calculations from Matrix and Vector Manipulation.",
    "tags": [],
    "sortOrder": 90,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/2D_Raycasting.png",
    "sourceUrl": "https://github.com/DylanHalstead/2d-raycasting"
  },
  {
    "id": "10",
    "title": "Bot-O-Matic",
    "description": "My technical assessment for my internship at RVO Health, bot-o-matic is a simple react app where you can race different types of robot. Taught myself the basics of React and Express in 24 hours to meet the deadline. Queue up robots at the same time for a head-to-head bout to see who's the best bot! Robots have varying attributes and skills that are better for specific tasks. Strategize on the best combination of robots and run them in a race! Every raced bot is put into the leaderboard where you can see where you rank again friends (or rivals).",
    "tags": [],
    "sortOrder": 100,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/Bot_O_Matic.png",
    "deploymentUrl": "https://bot-o-matic-vgo4hnokkq-ue.a.run.app/"
  },
  {
    "id": "11",
    "title": "PolyChord Website",
    "description": "A company website overhaul made during my internship with Polychord. My first time with design work, mobile friendly webpages, and UI/UX.",
    "tags": [],
    "sortOrder": 110,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/PolyChord_Website.png",
    "sourceUrl": "https://github.com/DylanHalstead/PolyChord-Website"
  },
  {
    "id": "12",
    "title": "Visify",
    "description": "Despite an increasing need for computer scientists in the world, as of 2021, only 5% of high school students study computer science. While many students will enroll into computer science programs in college, this lack of prior educational opportunities can make the transition into the world of programming difficult. We set out to create an app that can make the process of learning to code easier for students, by specifically visualizing what could otherwise be complicated data structures to beginners.",
    "tags": [],
    "sortOrder": 120,
    "imageSrc": "https://storage.googleapis.com/halstead_portfolio_images/Visify.jpg",
    "sourceUrl": "https://github.com/gitthing03/HoyaHacks2023"
  }
]
